import React from 'react';

const Blog = () => {
    return (
        <div className='container mt-4'>
            <div>
                <h3>1. Difference between javascript and nodejs.</h3>
                <p>1. জাভাস্ক্রিপ্ট হল একটি প্রোগ্রামিং ভাষা যা ওয়েবসাইট এবং ওয়েবপেজগুলির সাথে কাজ করে, কিন্তু নোডস হল একটি জাভাস্ক্রিপ্ট রানটাইম পরিবেশ যা জাভাস্ক্রিপ্ট ব্যবহার করে সার্ভার সাইডে লেখা এবং কাজ করতে ব্যবহৃত হয়। <br />
                    2. জাভাস্ক্রিপ্ট মূলত ফ্রন্টএন্ড ডেভেলপমেন্টের জন্য ব্যবহার করা হয়, কিছু জাভাস্ক্রিপ্ট লাইব্রেরি হল ReactJS, Angular, Vue Js যখন Node JS ব্যবহার করা হয় সার্ভার বা ব্যাকএন্ড ডেভেলপমেন্টের জন্য, সবচেয়ে জনপ্রিয় নোড JS ফ্রেমওয়ার্ক হল Express JS ।<br />
                    3. আমরা জাভাস্ক্রিপ্ট শুধুমাত্র ব্রাউজারে চালাতে পারি, অন্যদিকে Node Js ব্রাউজারে বাইরে চলতে পারে । <br />
                    4. জাভাস্ক্রিপ্ট যেকোনো ধরনের ব্রাউজার চালাতে পারে, কিন্তু নোড জেএস শুধুমাত্র Google দ্বারা তৈরি করা V8 ইঞ্জিন চালাতে পারে ।


                </p>
            </div>
            <div>
                <h3>2. Differences between SQL and NoSQL databases.</h3>
                <p>

                    1. SQL ডাটাবেসগুলি টেবিল-ভিত্তিক, SQL ডেটা টেবুলার ফর্ম্যাটে সংরক্ষণ করা হয় এবং NoSQL ডেটাবেসগুলি নন-টেবিল-ভিত্তিক, NoSQL ডাটাবেসগুলি JSON ফর্ম্যাট ব্যবহার করে ডেটা সংরক্ষণ করে। <br />
                    2. SQL একটি রিলেশনাল ডাটাবেস ম্যানেজমেন্ট সিস্টেম, এবং NoSQL হল একটি নন-রিলেশনাল ডাটাবেস ম্যানেজমেন্ট সিস্টেম। এসকিউএল হল একটি স্ট্রাকচার্ড কোয়েরি ল্যাঙ্গুয়েজ এবং NoSql হল একটি নন-স্ট্রাকচারাল কোয়েরি ল্যাঙ্গুয়েজ। <br />
                    3. SQL ডাটাবেসগুলি উল্লম্বভাবে স্কেলযোগ্য এবং জটিল প্রশ্নের জন্য স্যুট, NoSQL ডেটাবেসগুলি অনুভূমিকভাবে স্কেলযোগ্য এবং এটি জটিল প্রশ্নের জন্য উপযুক্ত নয়।<br />
                    4. এসকিউএল ডাটাবেসে স্ট্রাকচার্ড ডেটার জন্য পূর্বনির্ধারিত বা স্ট্যাটিক স্কিমা রয়েছে এবং NoSQL ডাটাবেসে অ-স্ট্রাকচার্ড ডেটার জন্য গতিশীল স্কিমা রয়েছে।
                </p>
            </div>
            <div>
                <h3>3. What is the purpose of jwt and how does it work ?</h3>
                <p>Jwt একটি JSON অবজেক্টকে ক্লায়েন্ট সাইড এবং সার্ভার সাইডের মধ্যে পক্ষগুলির মধ্যে নিরাপদে তথ্য স্থানান্তর করার একটি কম্প্যাক্ট এবং স্বয়ংক্রিয় উপায় হিসাবে সংজ্ঞায়িত করে।
                    JWT 2 উপায়ে কাজ করে। <br />
                    1. Frist সার্ভার jwt দিয়ে একটি টোকেন তৈরি করে এবং ক্লায়েন্টকে পাঠায় এবং কোথাও সংরক্ষণ করে। <br />
                    2. সার্ভার ক্লায়েন্টের কাছ থেকে সার্ভারে প্রতিটি বা ব্যক্তিগত অ্যাক্সেসের জন্য এই টোকেন কী চায়। সার্ভার তারপর যাচাই করার চেষ্টা করে যে এই টোকেনটি বৈধ, jwt যাচাই করার পরে ব্যবহারকারীর অ্যাক্সেস টোকেন এবং ব্যবহারকারীর আইডি চেক করুন। অ্যাক্সেস সফল হলে, ব্যবহারকারী একটি সফল প্রতিক্রিয়া পাবেন না। ব্যবহারকারী একটি ত্রুটি পাবে বা ব্যবহারকারীর অ্যাক্সেস অস্বীকার করবে।

                </p>
            </div>
        </div>
    );
};

export default Blog;